<?php

// Нарисуйте таблицу вида:
// 1 2 3 
// 8 9 4
// 7 6 5

// Ваша таблица должна быть размером не 3 на 3, а любого заданного размера, например, 10 на 10.

 $n=3;
 $A = array();
 $i=1;
 $j = 0;
 $k = 0;
 $p=$n/2;
 for($k=1;$k<=$p;$k++)
 {
 for ($j=$k-1;$j<$n-$k+1;$j++) $A[$k-1][$j]=$i++;
 for ($j=$k;$j<$n-$k+1;$j++) $A[$j][$n-$k]=$i++;
 for ($j=$n-$k-1;$j>=$k-1;--$j) $A[$n-$k][$j]=$i++;
 for ($j=$n-$k-1;$j>=$k;$j--) $A[$j][$k-1]=$i++;
 }
 if ($n%2==1) $A[$p][$p]=$n*$n;
 for($i=0;$i<$n;$i++)
  for($j=0;$j<$n;$j++)
  {
   echo $A[$i][$j];
   if($j==$n-1) echo '<br>';
  }   
?>